# 4 В строке удалить все буквы а и подсчитать количество удаленных символов

def delet_simvol()





# 5 Написать произвольную анкету и вывести полученные данные



















if __name__ == '__main__':
	print('######## Результаты ########')
	delet_simvol()